#ifndef __automata_penglei__
#define __automata_penglei__

#include <assert.h>
#include <stdio.h>

#include <algorithm>
#include <functional>
#include <vector>
#include <string>
#include <map>
#include <set>
#include <typeinfo>

#include <febird/num_to_str.hpp>

#include "nfa.hpp"
#include "dfa_algo.hpp"

enum { Automata_MemPool_Align = 4 };

// When MyBytes is 6, intentional waste a bit: sbit is 32, nbm is 5
// When sbits==34, sizeof(PackedState)==6, StateID is uint64, the State34
#pragma pack(push,1)
//template<class StateID, int MyBytes>
template<class StateID, int sbits, int nbmBits, int Sigma = 256>
class PackedState {
	BOOST_STATIC_ASSERT(Sigma >= 256);
	BOOST_STATIC_ASSERT(Sigma <= 512);
//	enum { sbits  = MyBytes == 6 ? 32 : 8 * MyBytes - 14 };
	enum { char_bits = Sigma > 256 ? 9 : 8 };
	enum { free_flag = (1 << nbmBits) - 1  };

	StateID  spos     : sbits; // spos: saved position
//	unsigned nbm      : MyBytes == 6 ? 6 : 4; // cnt of uint32 for bitmap, in [0, 9)
	unsigned nbm      : nbmBits; // cnt of uint32 for bitmap, in [0, 9)
	unsigned term_bit : 1;
	unsigned pzip_bit : 1; // is path compressed(zipped)?
	unsigned minch    : char_bits;

	BOOST_STATIC_ASSERT((sbits + nbmBits + 2 + char_bits) % 8 == 0);

public:
	enum { sigma = Sigma };
    typedef StateID  state_id_t;
    typedef StateID  position_t;
    static const state_id_t nil_state = sbits == 32 ? UINT_MAX : state_id_t(uint64_t(1) << sbits) - 1;
    static const state_id_t max_state = nil_state; // max_state <= nil_state, and could be overridden

    PackedState() {
        spos = nil_state;
		nbm = 0;
		term_bit = 0;
		pzip_bit = 0;
        minch = 0;
    }

	void setch(auchar_t ch) {
	   	minch = ch;
		nbm = 0;
   	}
	void setMinch(auchar_t ch) {
		assert(ch < minch);
		auchar_t maxch = (0 == nbm) ? minch : getMaxch();
		nbm = (maxch - ch) / 32 + 1;
		minch = ch;
   	}
	void setMaxch(auchar_t ch) {
		assert(ch > minch);
		assert(ch > getMaxch());
		nbm = (ch - minch) / 32 + 1;
   	}
	auchar_t getMaxch() const {
	   	if (0 == nbm)
		   return minch;
	   	unsigned maxch = minch + (nbm*32 - 1);
		return std::min<int>(Sigma-1, maxch);
   	}
	auchar_t getMinch() const { return minch; }
	bool  range_covers(auchar_t ch) const { return ch == minch || (ch > minch && ch < minch + nbm*32); }
	int   rlen() const { assert(0 != nbm); return nbm * 32; }
	bool  has_children() const { return 0 != nbm || spos != nil_state; }
	bool  more_than_one_child() const { return 0 != nbm; }

    bool is_term() const { return term_bit; }
	bool is_pzip() const { return pzip_bit; }
	bool is_free() const { return free_flag == nbm; }
    void set_term_bit() { term_bit = 1; }
	void set_pzip_bit() { pzip_bit = 1; }
    void clear_term_bit() { term_bit = 0; }
	void set_free() { nbm = free_flag; }
    void setpos(size_t tpos) {
        assert(tpos % Automata_MemPool_Align == 0);
		const size_t limit = size_t(nil_state) * Automata_MemPool_Align;
        if (tpos >= limit) {
			string_appender<> msg;
			msg << BOOST_CURRENT_FUNCTION << ": too large tpos=" << tpos
				<< ", limit=" << limit;
			throw std::logic_error(msg);
		}
        spos = position_t(tpos / Automata_MemPool_Align);
    }
    size_t getpos() const { return size_t(spos) * Automata_MemPool_Align; }
    state_id_t get_target() const { return spos; }
    void set_target(state_id_t t) { spos = t; }

	typedef state_id_t transition_t;
	static transition_t first_trans(state_id_t t) { return t; }
}; // end class PackedState
#pragma pack(pop)

typedef PackedState<uint32_t, 18, 4> State4B; ///< 4 byte per-state, max_state is 256K-1
typedef PackedState<uint32_t, 26, 4> State5B; ///< 5 byte per-state, max_state is  64M-1
typedef PackedState<uint32_t, 32, 6> State6B; ///< 6 byte per-state, max_state is   4G-1
BOOST_STATIC_ASSERT(sizeof(State4B) == 4);
BOOST_STATIC_ASSERT(sizeof(State5B) == 5);
BOOST_STATIC_ASSERT(sizeof(State6B) == 6);
#if FEBIRD_WORD_BITS >= 64
typedef PackedState<uint64_t, 34, 4> State34; ///< 6 byte per-state, max_state is  16G-1
BOOST_STATIC_ASSERT(sizeof(State34) == 6);
#endif
#if FEBIRD_WORD_BITS >= 64 && defined(FEBIRD_INST_ALL_DFA_TYPES)
typedef PackedState<uint64_t, 42, 4> State7B; ///< 7 byte per-state, max_state is   2T-1
BOOST_STATIC_ASSERT(sizeof(State7B) == 7);
#endif

typedef PackedState<uint32_t, 17, 4, 448> State4B_448; ///< 4 byte per-state, max_state is 128K-1
typedef PackedState<uint32_t, 25, 4, 448> State5B_448; ///< 5 byte per-state, max_state is  32M-1
typedef PackedState<uint32_t, 32, 5, 512> State6B_512; ///< 6 byte per-state, max_state is   4G-1
BOOST_STATIC_ASSERT(sizeof(State4B_448) == 4);
BOOST_STATIC_ASSERT(sizeof(State5B_448) == 5);
BOOST_STATIC_ASSERT(sizeof(State6B_512) == 6);
#if FEBIRD_WORD_BITS >= 64 && defined(FEBIRD_INST_ALL_DFA_TYPES)
typedef PackedState<uint64_t, 41, 4, 448> State7B_448; ///< 7 byte per-state, max_state is   1T-1
BOOST_STATIC_ASSERT(sizeof(State7B_448) == 7);
#endif

/// 8 byte per-state, max_state is 4G-1
template<int Sigma>
class State32_Tmpl {
	static const int char_bits = Sigma > 256 ? 9 : 8;
    // spos: saved position
    uint32_t spos; // spos*Automata_MemPool_Align is the offset to MemPool
    unsigned minch : char_bits;  // min char
    unsigned maxch : char_bits;  // max char, inclusive
    unsigned term_bit : 1;
	unsigned pzip_bit : 1;
	unsigned free_bit : 1;

public:
	enum { sigma = Sigma };
    typedef uint32_t  state_id_t;
    typedef uint32_t  position_t;
    static const state_id_t nil_state = ~(state_id_t)0;
    static const state_id_t max_state = nil_state;

    State32_Tmpl() {
        spos = nil_state;
        minch = maxch = 0;
		term_bit = 0;
		pzip_bit = 0;
		free_bit = 0;
    }

	void setch(auchar_t ch) { minch = maxch = ch; }
	void setMinch(auchar_t ch) { minch = ch; }
	void setMaxch(auchar_t ch) { maxch = ch; }
	auchar_t getMaxch() const { return maxch; }
